karthikv132/PIC16F887-PROJECTS/6.INTRUPTS/PORTB_INTERRUPT_1_PIN.X/PORTB_INTERRUPT_1_PIN.c
/*
 * File:   PORTB_INTERRUPT_1_PIN.c
 * Author: Anish D
 *
 * Created on 1 August, 2026, 2:20 PM
 */


// PIC16F887 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1
#pragma config FOSC = INTRC_NOCLKOUT// Oscillator Selection bits (INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = ON        // Internal External Switchover bit (Internal/External Switchover mode is enabled)
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is enabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.
#include <xc.h>
#define _XTAL_FREQ 4000000
//void __interrupt() ext();
//void delay(unsigned long int a);

void delay(unsigned long int a) {
    while (a--);
}

void enable() {
    RE1 = 1;
    __delay_ms(10); //delay(100);
    RE1 = 0;
    __delay_ms(10); // delay(100);
}

void lcd(char rs, char cmd) {
    RE0 = rs;
    PORTD = cmd;
    enable();
}

void str(char *ptr) {
    while (*ptr != '\0') {
        lcd(1, *ptr++);
    }
}
    void __interrupt() ext() {
        if (INTF == 1)//    (INTF == 1) 
        {
            RA0 = 0;
            RA1 = 0;
            //for (int i = 0; i < 5; i++) {
                RA2 = 1;
                lcd(0,0x01);
                str("EMERGENCY STOP");
                __delay_ms(3000); //delay(25000);
                RA2 = 0;
                __delay_ms(3000); //delay(25000);
            //}
           //         while (RBIF == 1);
                INTF = 0;
        }

    }
    void main(void) {
        TRISB = 0X01;
        PORTB = TRISA = PORTA = 0;
        ANSELH = 0X00;
        INTEDG = 1;
        INTCON = 0X90;
        TRISD = TRISE = 0x00;
        PORTD = PORTE = 0x00;
        ANSEL = 0x00;
        lcd(0, 0x38); //FUNCTION SET - 8 BIT - 2LINE
        delay(100);
        lcd(0, 0x0E); //DISPLAY ON / CURSOR ON
        delay(100);
        lcd(0, 0x80); //FORCE CURSOR TO BEGINNING OF FIRST ROW
        delay(100);
        while (1) {
            RA0 = 1;
            lcd(0,0x01);
            str("GOOOO...");
            __delay_ms(1000); // delay(25000);
            RA0 = 0;
            RA1 = 1;
            lcd(0,0x01);
            str("GET READY");
            __delay_ms(1000); //delay(25000);
            RA1 = 0;
            RA2 = 1;
            lcd(0,0x01);
            str("STOP");
            __delay_ms(1000); // delay(25000);
            RA2 = 0;
            lcd(0,0x01);
        }
    }


